cask_args appdir: '/Applications'

tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "dunn/emacs"
tap "edahlseng/core"
tap "heroku/brew"

brew "awscli"
brew "circleci"
brew "clang-format"
brew "clojure"
brew "coreutils"
brew "csvkit"
brew "direnv"
brew "ffmpeg"
brew "findutils"
brew "fwup"
brew "gawk"
brew "ghc"
brew "git"
brew "go"
brew "gpg"
brew "iperf"
brew "jq"
brew "kakoune"
brew "kops"
brew "kubectl"
brew "kubernetes-helm"
brew "leiningen"
brew "mas"
brew "mitmproxy"
brew "mongodb"
brew "nvm"
brew "picocom"
brew "postgresql"
brew "python3"
brew "rlwrap"
brew "sbcl"
brew "sops"
brew "task"
brew "tasksh"
brew "tfenv"
brew "trash"
brew "wget"
brew "youtube-dl"
brew "dunn/emacs/slime"
brew "edahlseng/core/git-sweep"
brew "edahlseng/core/swift-format", args: ["HEAD"]
brew "heroku/brew/heroku"

cask "anki"
cask "arduino"
cask "atom"
cask "dash"
cask "docker"
cask "fly"
cask "google-chrome"
cask "google-cloud-sdk"
cask "handbrake"
cask "hyper"
cask "java"
cask "jeromelebel-mongohub"
cask "lingo"
cask "mactex"
cask "ngrok"
cask "postman"
cask "rescuetime"
cask "sketch"
cask "skype"
cask "spectacle"
cask "torbrowser"
cask "vlc"
cask "wireshark"
cask "zeplin"

mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Fusion360", id: 868968810
mas "GarageBand", id: 682658836
mas "iConvert Icons", id: 515197296
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pocket", id: 568494494
mas "Slack", id: 803453959
mas "WeChat", id: 836500024
mas "Xcode", id: 497799835
