cask_args appdir: '/Applications'

tap "homebrew/bundle"
tap "borkdude/brew"
tap "edahlseng/core"
tap "golangci/tap"
tap "mongodb/brew"

brew "awscli"
brew "black"
brew "clang-format"
brew "clojure"
brew "conan"
brew "conan@1"
brew "coreutils"
brew "csvkit"
brew "direnv"
brew "doxygen"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdb"
brew "ghc"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "gpg"
brew "graphviz"
brew "grep"
brew "helm"
brew "iperf"
brew "java"
brew "jq"
brew "kakoune"
brew "kops"
brew "kubectl"
brew "llvm"
brew "make"
brew "mas"
brew "nvm"
brew "picocom"
brew "pipenv"
brew "postgresql@16"
brew "pylint"
brew "python3"
brew "rlwrap"
brew "sbcl"
brew "sops"
brew "swift-format"
brew "task"
brew "tasksh"
brew "tfenv"
brew "tor"
brew "trash"
brew "usbutils"
brew "wget"
brew "youtube-dl"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "borkdude/brew/clj-kondo"
brew "edahlseng/core/clang-tidy"
brew "edahlseng/core/git-sweep"
brew "golangci/tap/golangci-lint"
brew "mongodb/brew/mongodb-community"

cask "amazon-workspaces"
cask "anki"
cask "arc"
cask "arduino"
cask "atom"
cask "backblaze"
cask "brave-browser"
cask "dash"
cask "docker"
cask "expressvpn"
cask "figma"
cask "firefox"
cask "fly"
cask "font-fira-code"
cask "ghdl"
cask "google-chrome"
cask "google-cloud-sdk"
cask "grammarly-desktop"
cask "gtkwave"
cask "handbrake"
cask "hyper"
cask "kicad"
cask "lastpass"
cask "linear-linear"
cask "lingon-x"
cask "mactex"
cask "mitmproxy"
cask "mongodb-compass"
cask "ngrok"
cask "origami-studio"
cask "paragon-extfs"
cask "postman"
cask "saleae-logic"
cask "shotcut"
cask "sketch"
cask "skype"
cask "skyfonts"
cask "superhuman"
cask "tor-browser"
cask "vlc"
cask "vnc-viewer"
cask "wireshark"
cask "xquartz"
cask "zed"
cask "zeplin"

mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "Honey", id: 1472777122
mas "iConvert Icons", id: 515197296
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINER", id: 1463530746
mas "Magnet", id: 441258766
mas "Monosnap", id: 540348655
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pocket", id: 568494494
mas "Slack", id: 803453959
mas "Snippety", id: 1530751461
mas "WeChat", id: 836500024
mas "Xcode", id: 497799835
