cask_args appdir: '/Applications'

tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "dunn/emacs"
tap "edahlseng/core"

brew "awscli"
brew "clang-format"
brew "coreutils"
brew "ffmpeg"
brew "fwup"
brew "gawk"
brew "go"
brew "iperf"
brew "kops"
brew "kubectl"
brew "kubernetes-helm"
brew "mas"
brew "mitmproxy"
brew "mongodb"
brew "node"
brew "python3"
brew "rlwrap"
brew "sbcl"
brew "terraform"
brew "task"
brew "tasksh"
brew "trash"
brew "wget"
brew "youtube-dl"
brew "dunn/emacs/slime"
brew "edahlseng/core/git-sweep"

cask "anki"
cask "arduino"
cask "atom"
cask "dash"
cask "dropbox"
cask "google-chrome"
cask "handbrake"
cask "lingo"
cask "mactex"
cask "rescuetime"
cask "sketch"
cask "skype"
cask "spectacle"
cask "wireshark"

mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Fusion360", id: 868968810
mas "GarageBand", id: 682658836
mas "iConvert Icons", id: 515197296
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pocket", id: 568494494
mas "Slack", id: 803453959
mas "WeChat", id: 836500024
mas "Xcode", id: 497799835
